RT-Thread/rt-thread/bsp/stm32h743-nucleo/Libraries/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_hrtim.h
#define IS_HRTIM_TIMERID(TIMERID) (((TIMERID) & 0xFFC0FFFFU) == 0x00000000U)

/**
 * @}
 */
    
/** @defgroup HRTIM_Compare_Unit HRTIM Compare Unit
  * @{
  * @brief Constants defining compare unit identifiers
  */  
#define HRTIM_COMPAREUNIT_1 (uint32_t)0x00000001U  /*!< Compare unit 1 identifier. */
#define HRTIM_COMPAREUNIT_2 (uint32_t)0x00000002U  /*!< Compare unit 2 identifier. */
#define HRTIM_COMPAREUNIT_3 (uint32_t)0x00000004U  /*!< Compare unit 3 identifier. */
#define HRTIM_COMPAREUNIT_4 (uint32_t)0x00000008U  /*!< Compare unit 4 identifier. */

 /**
  * @}
  */
    
/** @defgroup HRTIM_Capture_Unit HRTIM Capture Unit
  * @{
  * @brief Constants defining capture unit identifiers
  */  
#define HRTIM_CAPTUREUNIT_1 (uint32_t)0x00000001U  /*!< Capture unit 1 identifier. */
#define HRTIM_CAPTUREUNIT_2 (uint32_t)0x00000002U  /*!< Capture unit 2 identifier. */

/**
  * @}
  */
 
/** @defgroup HRTIM_Timer_Output HRTIM Timer Output
  * @{
  * @brief Constants defining timer output identifiers
  */  
#define HRTIM_OUTPUT_TA1  (uint32_t)0x00000001U  /*!< Timer A - Ouput 1 identifier. */
#define HRTIM_OUTPUT_TA2  (uint32_t)0x00000002U  /*!< Timer A - Ouput 2 identifier. */
#define HRTIM_OUTPUT_TB1  (uint32_t)0x00000004U  /*!< Timer B - Ouput 1 identifier. */
#define HRTIM_OUTPUT_TB2  (uint32_t)0x00000008U  /*!< Timer B - Ouput 2 identifier. */
#define HRTIM_OUTPUT_TC1  (uint32_t)0x00000010U  /*!< Timer C - Ouput 1 identifier. */
#define HRTIM_OUTPUT_TC2  (uint32_t)0x00000020U  /*!< Timer C - Ouput 2 identifier. */
#define HRTIM_OUTPUT_TD1  (uint32_t)0x00000040U  /*!< Timer D - Ouput 1 identifier. */
#define HRTIM_OUTPUT_TD2  (uint32_t)0x00000080U  /*!< Timer D - Ouput 2 identifier. */
#define HRTIM_OUTPUT_TE1  (uint32_t)0x00000100U  /*!< Timer E - Ouput 1 identifier. */
#define HRTIM_OUTPUT_TE2  (uint32_t)0x00000200U  /*!< Timer E - Ouput 2 identifier. */
      
/**
  * @}
  */
    
/** @defgroup HRTIM_ADC_Trigger HRTIM ADC Trigger
  * @{
  * @brief Constants defining ADC triggers identifiers
  */
#define HRTIM_ADCTRIGGER_1  (uint32_t)0x00000001U  /*!< ADC trigger 1 identifier. */
#define HRTIM_ADCTRIGGER_2  (uint32_t)0x00000002U  /*!< ADC trigger 2 identifier. */
#define HRTIM_ADCTRIGGER_3  (uint32_t)0x00000004U  /*!< ADC trigger 3 identifier. */
#define HRTIM_ADCTRIGGER_4  (uint32_t)0x00000008U  /*!< ADC trigger 4 identifier. */

/**
  * @}
  */

/** @defgroup HRTIM_External_Event_Channels HRTIM External Event Channels
  * @{
  * @brief Constants defining external event channel identifiers
  */
#define HRTIM_EVENT_NONE     ((uint32_t)0x00000000U)     /*!< Undefined event channel. */
#define HRTIM_EVENT_1        ((uint32_t)0x00000001U)     /*!< External event channel 1 identifier. */
#define HRTIM_EVENT_2        ((uint32_t)0x00000002U)     /*!< External event channel 2 identifier. */
#define HRTIM_EVENT_3        ((uint32_t)0x00000004U)     /*!< External event channel 3 identifier. */
#define HRTIM_EVENT_4        ((uint32_t)0x00000008U)     /*!< External event channel 4 identifier. */
#define HRTIM_EVENT_5        ((uint32_t)0x00000010U)     /*!< External event channel 5 identifier. */
#define HRTIM_EVENT_6        ((uint32_t)0x00000020U)     /*!< External event channel 6 identifier. */
#define HRTIM_EVENT_7        ((uint32_t)0x00000040U)     /*!< External event channel 7 identifier. */
#define HRTIM_EVENT_8        ((uint32_t)0x00000080U)     /*!< External event channel 8 identifier. */
#define HRTIM_EVENT_9        ((uint32_t)0x00000100U)     /*!< External event channel 9 identifier. */
#define HRTIM_EVENT_10       ((uint32_t)0x00000200U)     /*!< External event channel 10 identifier. */

/**
  * @}
  */
    
/** @defgroup HRTIM_Fault_Channel HRTIM Fault Channel
  * @{
  * @brief Constants defining fault channel identifiers
  */ 
#define HRTIM_FAULT_1      ((uint32_t)0x01U)     /*!< Fault channel 1 identifier. */
#define HRTIM_FAULT_2      ((uint32_t)0x02U)     /*!< Fault channel 2 identifier. */
#define HRTIM_FAULT_3      ((uint32_t)0x04U)     /*!< Fault channel 3 identifier. */
#define HRTIM_FAULT_4      ((uint32_t)0x08U)     /*!< Fault channel 4 identifier. */
#define HRTIM_FAULT_5      ((uint32_t)0x10U)     /*!< Fault channel 5 identifier. */

/**
  * @}
  */


 /** @defgroup HRTIM_Prescaler_Ratio HRTIM Prescaler Ratio
  * @{
  * @brief Constants defining timer high-resolution clock prescaler ratio.
  */  
#define HRTIM_PRESCALERRATIO_MUL32    ((uint32_t)0x00000000U)  /*!< fHRCK: 4.608 GHz - Resolution: 217 ps - Min PWM frequency: 70.3 kHz (fHRTIM=144MHz). */
#define HRTIM_PRESCALERRATIO_MUL16    ((uint32_t)0x00000001U)  /*!< fHRCK: 2.304 GHz - Resolution: 434 ps - Min PWM frequency: 35.1 KHz (fHRTIM=144MHz). */
#define HRTIM_PRESCALERRATIO_MUL8     ((uint32_t)0x00000002U)  /*!< fHRCK: 1.152 GHz - Resolution: 868 ps - Min PWM frequency: 17.6 kHz (fHRTIM=144MHz). */
#define HRTIM_PRESCALERRATIO_MUL4     ((uint32_t)0x00000003U)  /*!< fHRCK: 576 MHz - Resolution: 1.73 ns - Min PWM frequency: 8.8 kHz (fHRTIM=144MHz). */
#define HRTIM_PRESCALERRATIO_MUL2     ((uint32_t)0x00000004U)  /*!< fHRCK: 288 MHz - Resolution: 3.47 ns - Min PWM frequency: 4.4 kHz (fHRTIM=144MHz). */
#define HRTIM_PRESCALERRATIO_DIV1     ((uint32_t)0x00000005U)  /*!< fHRCK: 144 MHz - Resolution: 6.95 ns - Min PWM frequency: 2.2 kHz (fHRTIM=144MHz). */
#define HRTIM_PRESCALERRATIO_DIV2     ((uint32_t)0x00000006U)  /*!< fHRCK: 72 MHz - Resolution: 13.88 ns- Min PWM frequency: 1.1 kHz (fHRTIM=144MHz). */
#define HRTIM_PRESCALERRATIO_DIV4     ((uint32_t)0x00000007U)  /*!< fHRCK: 36 MHz - Resolution: 27.7 ns- Min PWM frequency: 550Hz (fHRTIM=144MHz). */
       
/**
  * @}
  */
  
/** @defgroup HRTIM_Mode HRTIM Mode
  * @{
  * @brief Constants defining timer counter operating mode.
  */  
#define HRTIM_MODE_CONTINUOUS                ((uint32_t)0x00000008U)  /*!< The timer operates in continuous (free-running) mode. */
#define HRTIM_MODE_SINGLESHOT               ((uint32_t)0x00000000U)  /*!< The timer operates in non retriggerable single-shot mode. */
#define HRTIM_MODE_SINGLESHOT_RETRIGGERABLE ((uint32_t)0x00000010U)  /*!< The timer operates in retriggerable single-shot mode. */
            
/**
  * @}
  */
  
