RT-Thread/rt-thread/bsp/stm32h743-nucleo/Libraries/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_hrtim.h
/** @defgroup HRTIM_Burst_Mode_Control HRTIM Burst Mode Control
  * @{
  * @brief Constants used to enable or disable the burst mode controller
  */ 
#define HRTIM_BURSTMODECTL_DISABLED ((uint32_t)0x00000000U) /*!< Burst mode disabled. */
#define HRTIM_BURSTMODECTL_ENABLED  (HRTIM_BMCR_BME)        /*!< Burst mode enabled. */

/**
  * @}
  */

/** @defgroup HRTIM_Fault_Mode_Control  HRTIM Fault Mode Control
  * @{
  * @brief Constants used to enable or disable a fault channel
  */ 
#define HRTIM_FAULTMODECTL_DISABLED ((uint32_t)0x00000000U) /*!< Fault channel is disabled. */
#define HRTIM_FAULTMODECTL_ENABLED  ((uint32_t)0x00000001U) /*!< Fault channel is  enabled. */

/**
  * @}
  */

/** @defgroup HRTIM_Software_Timer_Update HRTIM Software Timer Update
  * @{
  * @brief Constants used to force timer registers update
  */ 
#define HRTIM_TIMERUPDATE_MASTER    (HRTIM_CR2_MSWU)     /*!< Forces an immediate transfer from the preload to the active register in the master timer. */
#define HRTIM_TIMERUPDATE_A         (HRTIM_CR2_TASWU)    /*!< Forces an immediate transfer from the preload to the active register in the timer A. */
#define HRTIM_TIMERUPDATE_B         (HRTIM_CR2_TBSWU)    /*!< Forces an immediate transfer from the preload to the active register in the timer B. */
#define HRTIM_TIMERUPDATE_C         (HRTIM_CR2_TCSWU)    /*!< Forces an immediate transfer from the preload to the active register in the timer C. */
#define HRTIM_TIMERUPDATE_D         (HRTIM_CR2_TDSWU)    /*!< Forces an immediate transfer from the preload to the active register in the timer D. */
#define HRTIM_TIMERUPDATE_E         (HRTIM_CR2_TESWU)    /*!< Forces an immediate transfer from the preload to the active register in the timer E. */

/**
  * @}
  */

/** @defgroup HRTIM_Software_Timer_Reset HRTIM Software Timer Reset
  * @{
  * @brief Constants used to force timer counter reset
  */ 
#define HRTIM_TIMERRESET_MASTER    (HRTIM_CR2_MRST)     /*!< Resets the master timer counter. */
#define HRTIM_TIMERRESET_TIMER_A   (HRTIM_CR2_TARST)    /*!< Resets the timer A counter. */
#define HRTIM_TIMERRESET_TIMER_B   (HRTIM_CR2_TBRST)    /*!< Resets the timer B counter. */
#define HRTIM_TIMERRESET_TIMER_C   (HRTIM_CR2_TCRST)    /*!< Resets the timer C counter. */
#define HRTIM_TIMERRESET_TIMER_D   (HRTIM_CR2_TDRST)    /*!< Resets the timer D counter. */
#define HRTIM_TIMERRESET_TIMER_E   (HRTIM_CR2_TERST)    /*!< Resets the timer E counter. */

/**
  * @}
  */

/** @defgroup HRTIM_Output_Level HRTIM Output Level
  * @{
  * @brief Constants defining the level of a timer output
  */ 
#define HRTIM_OUTPUTLEVEL_ACTIVE     ((uint32_t)0x00000001U) /*!< Forces the output to its active state. */
#define HRTIM_OUTPUTLEVEL_INACTIVE   ((uint32_t)0x00000002U) /*!< Forces the output to its inactive state. */
      
/**
  * @}
  */

/** @defgroup HRTIM_Output_State HRTIM Output State
  * @{
  * @brief Constants defining the state of a timer output
  */ 
#define HRTIM_OUTPUTSTATE_IDLE     ((uint32_t)0x00000001U)  /*!< Main operating mode, where the output can take the active or 
                                                              inactive level as programmed in the crossbar unit. */
#define HRTIM_OUTPUTSTATE_RUN      ((uint32_t)0x00000002U)  /*!< Default operating state (e.g. after an HRTIM reset, when the 
                                                              outputs are disabled by software or during a burst mode operation. */
#define HRTIM_OUTPUTSTATE_FAULT    ((uint32_t)0x00000003U)  /*!< Safety state, entered in case of a shut-down request on
                                                              FAULTx inputs. */
/**
  * @}
  */

/** @defgroup HRTIM_Burst_Mode_Status HRTIM Burst Mode Status
  * @{
  * @brief Constants defining the operating state of the burst mode controller
  */ 
#define HRTIM_BURSTMODESTATUS_NORMAL  ((uint32_t) 0x00000000U) /*!< Normal operation. */
#define HRTIM_BURSTMODESTATUS_ONGOING (HRTIM_BMCR_BMSTAT)      /*!< Burst operation on-going. */
/**
  * @}
  */
   
/** @defgroup HRTIM_Current_Push_Pull_Status HRTIM Current Push Pull Status
  * @{
  * @brief Constants defining on which output the signal is currently applied
  *        in push-pull mode
  */ 
#define HRTIM_PUSHPULL_CURRENTSTATUS_OUTPUT1   ((uint32_t) 0x00000000U)   /*!< Signal applied on output 1 and output 2 forced inactive. */
#define HRTIM_PUSHPULL_CURRENTSTATUS_OUTPUT2   (HRTIM_TIMISR_CPPSTAT)     /*!< Signal applied on output 2 and output 1 forced inactive. */
/**
  * @}
  */
   
/** @defgroup HRTIM_Idle_Push_Pull_Status HRTIM Idle Push Pull Status
  * @{
  * @brief Constants defining on which output the signal was applied, in 
  *        push-pull mode balanced fault mode or delayed idle mode, when the 
  *        protection was triggered
  */ 
#define HRTIM_PUSHPULL_IDLESTATUS_OUTPUT1   ((uint32_t) 0x00000000U)      /*!< Protection occurred when the output 1 was active and output 2 forced inactive. */
#define HRTIM_PUSHPULL_IDLESTATUS_OUTPUT2   (HRTIM_TIMISR_IPPSTAT)        /*!< Protection occurred when the output 2 was active and output 1 forced inactive. */
/**
  * @}
  */
   
/** @defgroup HRTIM_Common_Interrupt_Enable HRTIM Common Interrupt Enable
  * @{
  */ 
#define HRTIM_IT_NONE           ((uint32_t)0x00000000U) /*!< No interrupt enabled. */
#define HRTIM_IT_FLT1           HRTIM_IER_FLT1          /*!< Fault 1 interrupt enable. */
#define HRTIM_IT_FLT2           HRTIM_IER_FLT2          /*!< Fault 2 interrupt enable. */
#define HRTIM_IT_FLT3           HRTIM_IER_FLT3          /*!< Fault 3 interrupt enable. */
#define HRTIM_IT_FLT4           HRTIM_IER_FLT4          /*!< Fault 4 interrupt enable. */
#define HRTIM_IT_FLT5           HRTIM_IER_FLT5          /*!< Fault 5 interrupt enable. */
#define HRTIM_IT_SYSFLT         HRTIM_IER_SYSFLT        /*!< System Fault interrupt enable. */
#define HRTIM_IT_BMPER          HRTIM_IER_BMPER         /*!<  Burst mode period interrupt enable. */
      
/**
  * @}
  */

/** @defgroup HRTIM_Master_Interrupt_Enable HRTIM Master Interrupt Enable
  * @{
  */ 
#define HRTIM_MASTER_IT_NONE         ((uint32_t)0x00000000U) /*!< No interrupt enabled. */
#define HRTIM_MASTER_IT_MCMP1        HRTIM_MDIER_MCMP1IE     /*!< Master compare 1 interrupt enable. */
#define HRTIM_MASTER_IT_MCMP2        HRTIM_MDIER_MCMP2IE     /*!< Master compare 2 interrupt enable. */
#define HRTIM_MASTER_IT_MCMP3        HRTIM_MDIER_MCMP3IE     /*!< Master compare 3 interrupt enable. */
#define HRTIM_MASTER_IT_MCMP4        HRTIM_MDIER_MCMP4IE     /*!< Master compare 4 interrupt enable. */
#define HRTIM_MASTER_IT_MREP         HRTIM_MDIER_MREPIE      /*!< Master Repetition interrupt enable. */
#define HRTIM_MASTER_IT_SYNC         HRTIM_MDIER_SYNCIE      /*!< Synchronization input interrupt enable. */
#define HRTIM_MASTER_IT_MUPD         HRTIM_MDIER_MUPDIE      /*!< Master update interrupt enable. */

/**
  * @}
  */

/** @defgroup HRTIM_Timing_Unit_Interrupt_Enable HRTIM Timing Unit Interrupt Enable
  * @{
  */ 
#define HRTIM_TIM_IT_NONE       ((uint32_t)0x00000000U)   /*!< No interrupt enabled. */
#define HRTIM_TIM_IT_CMP1       HRTIM_TIMDIER_CMP1IE      /*!< Timer compare 1 interrupt enable. */
#define HRTIM_TIM_IT_CMP2       HRTIM_TIMDIER_CMP2IE      /*!< Timer compare 2 interrupt enable. */
#define HRTIM_TIM_IT_CMP3       HRTIM_TIMDIER_CMP3IE      /*!< Timer compare 3 interrupt enable. */
#define HRTIM_TIM_IT_CMP4       HRTIM_TIMDIER_CMP4IE      /*!< Timer compare 4 interrupt enable. */
#define HRTIM_TIM_IT_REP        HRTIM_TIMDIER_REPIE       /*!< Timer repetition interrupt enable. */
#define HRTIM_TIM_IT_UPD        HRTIM_TIMDIER_UPDIE       /*!< Timer update interrupt enable. */
#define HRTIM_TIM_IT_CPT1       HRTIM_TIMDIER_CPT1IE      /*!< Timer capture 1 interrupt enable. */
#define HRTIM_TIM_IT_CPT2       HRTIM_TIMDIER_CPT2IE      /*!< Timer capture 2 interrupt enable. */
#define HRTIM_TIM_IT_SET1       HRTIM_TIMDIER_SET1IE      /*!< Timer output 1 set interrupt enable. */
#define HRTIM_TIM_IT_RST1       HRTIM_TIMDIER_RST1IE      /*!< Timer output 1 reset interrupt enable. */
#define HRTIM_TIM_IT_SET2       HRTIM_TIMDIER_SET2IE      /*!< Timer output 2 set interrupt enable. */
#define HRTIM_TIM_IT_RST2       HRTIM_TIMDIER_RST2IE      /*!< Timer output 2 reset interrupt enable. */
#define HRTIM_TIM_IT_RST        HRTIM_TIMDIER_RSTIE       /*!< Timer reset interrupt enable. */
#define HRTIM_TIM_IT_DLYPRT     HRTIM_TIMDIER_DLYPRTIE    /*!< Timer delay protection interrupt enable. */
      
/**
  * @}
  */

